---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyAnalysisWindowType.SolarHeatGainCoefficient
source: html/fc1f4e33-b633-ef35-8683-9c4480b1f640.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisWindowType.SolarHeatGainCoefficient Property

The solar heat gain coefficient (SHGC-value) for the window type.

## Syntax (C#)
```csharp
public double SolarHeatGainCoefficient { get; }
```